tutorials/incompressibleVoF/wave3D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (   0    0 -300) (1200    0 -300) (2700    0 -300)
    (   0 1200 -300) (1200 1200 -300) (2700 1200 -300)
    (   0 2700 -300) (1200 2700 -300) (2700 2700 -300)

    (   0    0  300) (1200    0  300) (2700    0  300)
    (   0 1200  300) (1200 1200  300) (2700 1200  300)
    (   0 2700  300) (1200 2700  300) (2700 2700  300)
);

blocks
(
    hex (0 1 4 3  9 10 13 12) (67 67 40) simpleGrading (1 1 1)
    hex (1 2 5 4 10 11 14 13) (27 67 40) simpleGrading (8 1 1)
    hex (3 4 7 6 12 13 16 15) (67 27 40) simpleGrading (1 8 1)
    hex (4 5 8 7 13 14 17 16) (27 27 40) simpleGrading (8 8 1)
);

defaultPatch
{
    name frontAndBack;
    type empty;
}

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 12 9)
            (3 6 15 12)
        );
    }
    inletSide
    {
        type patch;
        faces
        (
            (0 1 10 9)
            (1 2 11 10)
        );
    }
    outletSide
    {
        type symmetryPlane;
        faces
        (
            (6 7 16 15)
            (7 8 17 16)
        );
    }
    outlet
    {
        type symmetryPlane; //patch;
        faces
        (
            (2 5 14 11)
            (5 8 17 14)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (0 1 4 3)
            (1 2 5 4)
            (3 4 7 6)
            (4 5 8 7)
        );
    }
    top
    {
        type patch;
        faces
        (
            (9 10 13 12)
            (10 11 14 13)
            (12 13 16 15)
            (13 14 17 16)
        );
    }
);


// ************************************************************************* //
